content/posts/2023/11/gtd.md
---
title: "任务清单"
date: 2023-11-19T10:00:00+08:00
lastmod: 2023-11-20T15:47:47+08:00
draft: false
toc: true
---

## <span class="org-todo done DONE">DONE</span> blog github actions 发布出错 <https://github.com/oLd-Y/blog/actions/workflows/hugo.yml> {#blog-github-actions-发布出错-https-github-dot-com-old-y-blog-actions-workflows-hugo-dot-yml}

-   State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2023-11-20 周一 14:13]</span></span>


## <span class="org-todo done DONE">DONE</span> (idea) vim 高亮搜索单词 {#idea--vim-高亮搜索单词}

-   State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2023-11-20 周一 15:47]</span></span>


## <span class="org-todo done DONE">DONE</span> 公司 ideaVim 安装 {#公司-ideavim-安装}

-   State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2023-11-20 周一 15:46]</span></span>


### C-; 快捷键切换设置 {#c-快捷键切换设置}


### 寄存器改为系统粘贴板设置 {#寄存器改为系统粘贴板设置}


## <span class="org-todo todo TODO">TODO</span> vim 多光标操作 {#vim-多光标操作}


## <span class="org-todo todo TODO">TODO</span> 家里 IDEA 的 live template(wi, fori 等) {#家里-idea-的-live-template--wi-fori-等}


## <span class="org-todo todo TODO">TODO</span> vim 搜索忽略大小写 {#vim-搜索忽略大小写}


## <span class="org-todo todo TODO">TODO</span> 使用 Git 实现自动同步 {#使用-git-实现自动同步}


## <span class="org-todo todo TODO">TODO</span> markdown 转成 org-mode {#markdown-转成-org-mode}


## <span class="org-todo todo TODO">TODO</span> 公司 windows 右键菜单简化 {#公司-windows-右键菜单简化}


## <span class="org-todo todo TODO">TODO</span> idea 每次拉取代码都会跟 .idea/workspace.xml 冲突 {#idea-每次拉取代码都会跟-dot-idea-workspace-dot-xml-冲突}


## <span class="org-todo todo TODO">TODO</span> 公司 VFP 项目管理器在主表单获取焦点时会自动隐藏, 而家里的则不会 {#公司-vfp-项目管理器在主表单获取焦点时会自动隐藏-而家里的则不会}


## <span class="org-todo todo TODO">TODO</span> MdNice 网站(将 md 转为公众号, 知乎等支持的格式) {#mdnice-网站--将-md-转为公众号-知乎等支持的格式}


## <span class="org-todo todo TODO">TODO</span> 剪映和 PR 对比 {#剪映和-pr-对比}


## <span class="org-todo todo TODO">TODO</span> org-mode 将格式化的文字快速转为表格(一般从网页中的表格复制而来) {#org-mode-将格式化的文字快速转为表格--一般从网页中的表格复制而来}


## <span class="org-todo todo TODO">TODO</span> org-mode 如何表示行内代码 {#org-mode-如何表示行内代码}
